In [3]:
import pandas as pd
import numpy as np

In [5]:
df=pd.read_csv('StudentsPerformance - StudentsPerformance.csv')

In [6]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,NaN
1,female,group C,some college,standard,completed,69,90,88.0
2,female,group B,master's degree,standard,none,90,95,93.0
3,male,group A,associate's degree,free/reduced,none,47,57,44.0
4,male,group C,some college,standard,none,76,78,75.0

In [7]:
import nltk

In [8]:
from nltk import sent_tokenize,word_tokenize
from nltk.corpus import stopwords

In [10]:
from nltk.stem import PorterStemmer
from nltk.stem import WordNetLemmatizer

In [11]:
from nltk import pos_tag

In [13]:
sentence ="Hello world i am very happy"
print(sent_tokenize(sentence))
print(word_tokenize(sentence))

['Hello world i am very happy']
['Hello', 'world', 'i', 'am', 'very', 'happy']

In [14]:
words = word_tokenize(sentence)

In [15]:
print(pos_tag(words))

[('Hello', 'NNP'), ('world', 'NN'), ('i', 'NN'), ('am', 'VBP'), ('very', 'RB'), ('happy', 'JJ')]

In [18]:
sentence1 = "You are play playing played"
words = word_tokenize(sentence1)
stem = PorterStemmer()
for w in words:
    print(w,stem.stem(w))

You you
are are
play play
playing play
played play

In [19]:
sentence1 = "You are play playing played"
words = word_tokenize(sentence1)
stem = WordNetLemmatizer()
for w in words:
    print(w,stem.lemmatize(w))

You You
are are
play play
playing playing
played played

In [22]:
documentA = 'Jupiter is the largest planet'
documentB = 'Mars is the forth planet from solar system'
bagofwordsA = documentA.split(' ')
bagofwordsB = documentB.split(' ')
unique_words = set(bagofwordsA).union(set(bagofwordsB))

In [47]:
wordDictA = dict.fromkeys(unique_words,0)
wordDictB = dict.fromkeys(unique_words,0)
for i in bagofwordsA:
    wordDictA[i] = 1
for i in bagofwordsB:
    wordDictB[i] = 1
pd.DataFrame([wordDictA,wordDictB])

   from  largest  is  Mars  forth  the  planet  Jupiter  system  solar
0     0        1   1     0      0    1       1        1       0      0
1     1        0   1     1      1    1       1        0       1      1

In [48]:
def compute(dictList,bagofwords):
    bagofwordscount = len(bagofwords)
    tf={}
    for word,count in dictList.items():
        tf[word] = count/float(bagofwordscount)
    return tf

In [49]:
tfA = compute(wordDictA,bagofwordsA)
tfB = compute(wordDictB,bagofwordsB)
tfA

{'from': 0.0,
 'largest': 0.2,
 'is': 0.2,
 'Mars': 0.0,
 'forth': 0.0,
 'the': 0.2,
 'planet': 0.2,
 'Jupiter': 0.2,
 'system': 0.0,
 'solar': 0.0}

In [50]:
import math
def computeidf(document):
    idfs={}
    N = len(document)
    idfs = dict.fromkeys(document[0].keys(),0)
    for word,val in idfs.items():
        idfs[word] = math.log10(N/(float(val)+1))
    return idfs

In [52]:
idfs = computeidf([wordDictA,wordDictB])
idfs

{'from': 0.3010299956639812,
 'largest': 0.3010299956639812,
 'is': 0.3010299956639812,
 'Mars': 0.3010299956639812,
 'forth': 0.3010299956639812,
 'the': 0.3010299956639812,
 'planet': 0.3010299956639812,
 'Jupiter': 0.3010299956639812,
 'system': 0.3010299956639812,
 'solar': 0.3010299956639812}

In [56]:
def tfidf(tfBow,idfs):
    tfidf={}
    for word,val in tfBow.items():
        tfidf[word] = val*idfs[word]
    return tfidf

In [57]:
pd.DataFrame([tfidf(tfA,idfs),tfidf(tfB,idfs)])

,from,largest,is,Mars,forth,the,planet,Jupiter,system,solar
0,0.000000,0.060206,0.060206,0.000000,0.000000,0.060206,0.060206,0.060206,0.000000,0.000000
1,0.037629,0.000000,0.037629,0.037629,0.037629,0.037629,0.037629,0.000000,0.037629,0.037629

In [55]:
def computetfidf(tfBow,idfs):
    tfidf = {}
    for word,val in tfBow.items():
        tfidf[word] = val*idfs[word]
    return tfidf
pd.DataFrame([computetfidf(tfA,idfs),computetfidf(tfB,idfs)])

,from,largest,is,Mars,forth,the,planet,Jupiter,system,solar
0,0.000000,0.060206,0.060206,0.000000,0.000000,0.060206,0.060206,0.060206,0.000000,0.000000
1,0.037629,0.000000,0.037629,0.037629,0.037629,0.037629,0.037629,0.000000,0.037629,0.037629

In [58]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,NaN
1,female,group C,some college,standard,completed,69,90,88.0
2,female,group B,master's degree,standard,none,90,95,93.0
3,male,group A,associate's degree,free/reduced,none,47,57,44.0
4,male,group C,some college,standard,none,76,78,75.0
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95.0
996,male,group C,high school,free/reduced,none,62,55,55.0
997,female,group C,high school,free/reduced,completed,59,71,65.0
998,female,group D,some college,standard,completed,68,78,77.0
999,female,group D,some college,free/reduced,none,77,86,86.0